print("เลือกระบบที่ต้องการใช้ 1 คือ บวก 2 คือ ลบ 3 คือ หาร 4 คือ คูณ")
a = int(input("ใส่ตัวเลขระบบ = "))
print("\n")
if a == 1:
    b = int(input("ใส่ตัวเลขที่ต้องการ = "))
    c = int(input("ใส่ตัวเลขที่ต้องการ = "))
    d = b + c
if a == 2:
    b = int(input("ใส่ตัวเลขที่ต้องการ = "))
    c = int(input("ใส่ตัวเลขที่ต้องการ = "))
    d = b - c    
if a == 3:
    b = int(input("ใส่ตัวเลขที่ต้องการ = "))
    c = int(input("ใส่ตัวเลขที่ต้องการ = "))
    d = b // c
if a ==4:
    b = int(input("ใส่ตัวเลขที่ต้องการ = "))
    c = int(input("ใส่ตัวเลขที่ต้องการ = "))
    d = b * c

print("เลขที่ได้คือ =", d )